In [1]:
import pandas as pd
import numpy as np
import dateutil

#1 load data from csv file

#phone=pd.read_csv("c:/Users/sol/Desktop/python_test/phone_data.csv")
phone=pd.DataFrame.from_csv("c:/Users/sol/Desktop/python_test/phone_data.csv")
phone.head()

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [2]:
#2 convert date from string to date times

phone['date']=phone['date'].apply(dateutil.parser.parse, dayfirst=True)
phone.head()

                     date  duration  item    month   network network_type
index
0     2014-10-15 06:58:00    34.429  data  2014-11      data         data
1     2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2     2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3     2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4     2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

### [ practice ]

#### how many rows the dataset

In [3]:
phone['item'].count()

830

#### what was the longest phone call

In [4]:
phone['duration'][phone['item']=='call'].sum()

92321.0

#### how much used sms

In [5]:
phone['item'][phone['item']=='sms'].count()

292

In [6]:
phone['item'].value_counts()

call    388
sms     292
data    150
Name: item, dtype: int64

#### how many entries are ther for each month

In [7]:
phone['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

#### number of non-null unique network entries

In [8]:
phone['network'].nunique()

9

In [9]:
phone['network'].unique()

array(['data', 'Vodafone', 'Meteor', 'Tesco', 'Three', 'voicemail',
       'landline', 'special', 'world'], dtype=object)

## groupby( )

In [10]:
phone.groupby(['month']).groups

{'2014-11': Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
             ...
             220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
            dtype='int64', name='index', length=230),
 '2014-12': Int64Index([228, 231, 232, 233, 234, 235, 236, 237, 238, 239,
             ...
             377, 378, 379, 380, 382, 383, 384, 385, 387, 388],
            dtype='int64', name='index', length=157),
 '2015-01': Int64Index([381, 386, 389, 390, 391, 392, 393, 394, 395, 396,
             ...
             583, 584, 585, 587, 588, 589, 590, 591, 592, 593],
            dtype='int64', name='index', length=205),
 '2015-02': Int64Index([577, 586, 594, 595, 596, 597, 598, 599, 600, 601,
             ...
             719, 720, 721, 722, 723, 724, 725, 726, 727, 728],
            dtype='int64', name='index', length=137),
 '2015-03': Int64Index([729, 730, 731, 732, 733, 734, 735, 736, 737, 738,
             ...
             820, 821, 822, 823, 824, 825, 826, 827, 828, 829],
            dtype='int64', name='index', length=101)}

In [11]:
phone.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [12]:
len(phone.groupby(['month']).groups['2014-11'])

230

In [13]:
phone.groupby('month').first()

                       date  duration  item   network network_type
month
2014-11 2014-10-15 06:58:00    34.429  data      data         data
2014-12 2014-11-13 06:58:00    34.429  data      data         data
2015-01 2014-12-13 06:58:00    34.429  data      data         data
2015-02 2015-01-13 06:58:00    34.429  data      data         data
2015-03 2015-02-12 20:15:00    69.000  call  landline     landline

In [14]:
phone.groupby('month').last()

                       date  duration  item   network network_type
month
2014-11 2014-11-13 22:31:00     1.000   sms  Vodafone       mobile
2014-12 2014-12-14 19:54:00    25.000  call     Three       mobile
2015-01 2015-01-14 23:36:00     1.000   sms     Three       mobile
2015-02 2015-02-12 06:58:00    34.429  data      data         data
2015-03 2015-03-14 00:16:00     1.000   sms     world        world

In [15]:
phone.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [16]:
phone.groupby('month')['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [17]:
#what is the sum of durations, for calls only, to each network
phone[phone['item']=='call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [18]:
#groupby(more than one variable)
phone.groupby(['month','item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [19]:
#groupby output format(series or dataframe)
a=phone.groupby('month')['duration'].sum()
type(a)

pandas.core.series.Series

In [20]:
b=phone.groupby('month')[['duration']].sum()
type(b)

pandas.core.frame.DataFrame

In [21]:
c=phone.groupby('month', as_index=False).agg({'duration':'sum'})
type(c)

pandas.core.frame.DataFrame

In [22]:
phone.groupby('month').agg({'duration':'sum'})

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

## agg( ) 
aggregation : this function allows multiple statistics to be calculated per group in one calculation.

In [23]:
#applying a single function to columns in groups
phone.groupby(['month','item']).agg({'duration':'sum', 'network_type':'count', 'date':'first'})

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-02-12 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

In [24]:
#applying multiple functions to columns in groups
agg_def={'duration':[min,max,sum], 'network_type':'count', 'date':[min, 'first','nunique']}
phone.groupby(['month','item']).agg(agg_def)

             duration                       network_type                date  \
                  min        max        sum        count                 min
month   item
2014-11 call    1.000   1940.000  25547.000          107 2014-10-15 06:58:00
        data   34.429     34.429    998.441           29 2014-10-15 06:58:00
        sms     1.000      1.000     94.000           94 2014-10-16 22:18:00
2014-12 call    2.000   2120.000  13561.000           79 2014-11-14 17:24:00
        data   34.429     34.429   1032.870           30 2014-11-13 06:58:00
        sms     1.000      1.000     48.000           48 2014-11-14 17:28:00
2015-01 call    2.000   1859.000  17070.000           88 2014-12-15 20:03:00
        data   34.429     34.429   1067.299           31 2014-12-13 06:58:00
        sms     1.000      1.000     86.000           86 2014-12-15 19:56:00
2015-02 call    1.000   1863.000  14416.000           67 2015-01-15 10:36:00
        data   34.429     34.429   1067.299           31 2015-01-13 06:58:00
        sms     1.000      1.000     39.000           39 2015-01-15 12:23:00
2015-03 call    2.000  10528.000  21727.000           47 2015-02-12 20:15:00
        data   34.429     34.429    998.441           29 2015-02-13 06:58:00
        sms     1.000      1.000     25.000           25 2015-02-19 18:46:00


                           first nunique
month   item
2014-11 call 2014-10-15 06:58:00     104
        data 2014-10-15 06:58:00      29
        sms  2014-10-16 22:18:00      79
2014-12 call 2014-11-14 17:24:00      76
        data 2014-11-13 06:58:00      30
        sms  2014-11-14 17:28:00      41
2015-01 call 2014-12-15 20:03:00      84
        data 2014-12-13 06:58:00      31
        sms  2014-12-15 19:56:00      58
2015-02 call 2015-01-15 10:36:00      67
        data 2015-01-13 06:58:00      31
        sms  2015-01-15 12:23:00      27
2015-03 call 2015-02-12 20:15:00      47
        data 2015-02-13 06:58:00      29
        sms  2015-02-19 18:46:00      17

In [25]:
#renaming grouped statistic
grouped = phone.groupby('month').agg({"duration": [min, max, sum]})
grouped.columns=["_".join(x) for x in grouped.columns.ravel()]
grouped.head()

         duration_min  duration_max  duration_sum
month
2014-11           1.0        1940.0     26639.441
2014-12           1.0        2120.0     14641.870
2015-01           1.0        1859.0     18223.299
2015-02           1.0        1863.0     15522.299
2015-03           1.0       10528.0     22750.441